[
  {"type":"single","joke":"معلّم: که چیرې د نړۍ پای ته رسېدل پیل شي، تاسې به څه کوئ؟ زده کوونکی: زه به بیا خپل کورسونه بیا پیل کړم—تر څو ټولې ازموینې له سره ورکړم!"},
  {"type":"twopart","setup":"یو سړی دوکان ته ولاړ او پوښتنه یې وکړه:","delivery":"ایا دا څه نوی دی؟ دوکاندار: نه، نوی یې په زوړ کڅوړه کې اچولی دی!"},
  {"type":"single","joke":"میړه له خپلې مېرمنې وپوښتل: ولې دومره چپ يې؟ مېرمن: ځکه چې زه ستاسو د حیرانتیا لپاره ژوندي پاتې کېږم."},
  {"type":"single","joke":"یو هلک خپلې کورنۍ ته وویل چې نوم مې د انټرنیټ د سرعت په څېر شهرت لري — ټول وايي 'تېز' خو هر وخت بند وي."},
  {"type":"twopart","setup":"استاد: ولې ټولګي ته ناوخته راغلې؟","delivery":"زده کونکی: ما سړک بند وموند، استاد؛ هغه ونه ویل چې زه موټر لرم یا روزګار!"},
  {"type":"single","joke":"پلار: ولې په کور کې بریښنا سست ده؟ زوی: ځکه چې لامپونه د آرام وخت لري."},
  {"type":"single","joke":"یو سړی خپل ملګري ته وویل: زما خوب داسې و لکه فلم. ملګری: کوم فلم؟ سړی: خاموشۍ او مودونه—هیڅ غږ او هیڅ عمل!"},
  {"type":"twopart","setup":"یو سړی ډاکتر ته وویل چې زه هره شپه خوب وینم چې زه مرمۍ لرم.","delivery":"ډاکتر: دا څه بده خبره ده؟ سړی: ښه ده، ځکه چې ما هم د خوب کې ویده کېدو زده کړه ده!"},
  {"type":"twopart","setup":"د بازار پلورونکی: خوراکي توکې تازه دي!","delivery":"پېرېدونکی: څنګه؟ پلورونکی: ځکه چې تر پرون پورې ما هم نه خوړلي وو!"},
  {"type":"twopart","setup":"لومړی ملګری: ته ولې له ما واټس اپ نه ځوابوې؟","delivery":"دویم ملګری: ما خو ۳۰۰ پیغامونه ولیدل؛ خو زه لا تر اوسه تصمیم نه دی نیولی کوم ته ځواب ورکړم!"},
  {"type":"single","joke":"یو ماشوم خپلې مور ته وویل: زه یو لوی انسان جوړېدلم. مور: ولې؟ ماشوم: ځکه چې زه اوس د خواړو لپاره نورې پیسې غواړم!"},
  {"type":"twopart","setup":"پوښتنه: کمره ګرمه شوه؟","delivery":"ځواب: هو، ځکه چې زموږ سیلر د 'کولر' دستور نه پوهېږي!"},
  {"type":"single","joke":"ښاروال: ولې ترافيک دومره زیات دی؟ پولیس: ځکه چې موټرونکي ټول غواړي خپل موټرونه یو ځای کې ودرېږي وليکئ!"},
  {"type":"single","joke":"یو څوک: زما کمپیوټر ډیر هوښیار دی. ملګری: څنګه؟ هغه وایی 'د رمز داخل کړئ' او زه یې لمر ته یادونه کوم!"},
  {"type":"twopart","setup":"ښځې د ليدو لپاره له رڼا سره خبرې کولې:","delivery":"رڼا: زه خاموشه یم، ما ته 'سویچ' ووایه!"},
  {"type":"single","joke":"دوکاندار: دا کالي ۵۰٪ رعایت لري. پېرېدونکی: نو قیمت نیمه دی؟ دوکاندار: نه، یوازې اندازه نیمه ده!"},
  {"type":"twopart","setup":"شوګر والر: ولې ته ډیر خوندور نه ښکاری؟","delivery":"ملگری: ځکه چې ما خپل خوږی ټول په کور کې پرېښودی!"},
  {"type":"single","joke":"يو کس: زه د ژوند خوند اخلم. ملګری: څنګه؟ هغه: کله چې خلک زما ټوپک ته ګوري نو زه تمرین نه کوم!"},
  {"type":"twopart","setup":"پلار له زوی څخه: ولې ټیسټونه همیشه خراب دي؟","delivery":"زوی: ځکه چې ټیسټونه د شپې خوب نه ویني!"},
  {"type":"single","joke":"یو سړی: زه د هیرولو ناروغۍ لرم — ما هیر کړی چې د چا خبرېږم!"},
  {"type":"single","joke":"کوربه: موږ به سبا غرمه چای وڅښو. مېلمه: ډیر ښه؛ د چای ساعت راته ووايه — زه باید خپل برنامه پاکه کړم!"},
  {"type":"twopart","setup":"ډاکټر: تاسو خامخا ورزش وکړئ. مریض: کومه اندازه؟","delivery":"ډاکټر: د تلویزیون د چورلکې بدلول او د ریموټ اختلاس پیل کړئ!"},
  {"type":"single","joke":"سړی: ما خپل ځان ته ژمنه وکړه چې کم به خوراک کوم. بل سړی: او څه؟ سړی: ما خپله ژمنه وخوړه!"},
  {"type":"twopart","setup":"پوښتنه: ولې چرګ سرته تېر شو؟","delivery":"ځواب: ځکه چې بلې خوا یو وړوکی تېرېدو لپاره شتون درلود!"},
  {"type":"single","joke":"یو څوک: ما خپل بانک ته زنګ وواهه. بانک: ستاسو پیسې خوندي دي؛ سړی: نو ولې زما همکاري مې بنده شوه؟"},
  {"type":"twopart","setup":"استاد: ولې کتاب لوستل ختم نه شو؟","delivery":"زده کونکی: ځکه چې پاڼې هم آرام غواړي!"},
  {"type":"single","joke":"یو فیشنر: ما نوې جامې وپیرلې. ملګری: څه نوې؟ هغه: د رنګ انتخاب یوه میاشته وخت ونیوه!"}
]
