[
  {"type": "single", "joke": "معلم له شاګرده وپوښتل: که د نړۍ پای راورسیږي، ته به څه کوې؟ شاګرد: زه به خپل کورسونه له سره پیل کړم، چې ټولې ازموینې بیا ورکړم!"},
  {"type": "twopart", "setup": "یو سړی دوکان ته ولاړ او پوښتنه یې وکړه:", "delivery": "ایا دا شی نوی دی؟ دوکاندار: نه، نوی مو په زړو کڅوړو کې درته اچولی دی!"},
  {"type": "single", "joke": "مېړه له خپلې مېرمنې وپوښتل: ولې دومره غلې یې؟ مېرمن: ځکه غواړم ستا د حیرانتیا لپاره ژوندۍ پاتې شم."},
  {"type": "single", "joke": "یو هلک خپلې کورنۍ ته وویل: زما نوم د انټرنیټ د سرعت په څېر دی، ټول وايي 'تېز' دی خو هر وخت بند وي."},
  {"type": "twopart", "setup": "استاد: ولې ټولګي ته ناوخته راغلې؟", "delivery": "شاګرد: استاد، پر سړک لیکلي و چې 'ورو ځئ'، نو ځکه مې احتیاط وکړ!"},
  {"type": "single", "joke": "پلار: په کور کې برېښنا ولې کمه شوې؟ زوی: ځکه چې څراغونه د ارام وخت غواړي."},
  {"type": "single", "joke": "یو سړی خپل ملګري ته وویل: زما خوب داسې و لکه فلم. ملګری: کوم فلم؟ سړی: 'خاموشي'، نه غږ و او نه حرکت!"},
  {"type": "twopart", "setup": "یو سړی ډاکټر ته ورغی: ډاکټر صاحب، هره شپه خوب وینم چې کرکټ کوم.", "delivery": "ډاکټر: دا خو ښه خبره ده! سړی: ښه خبره خو ده، خو کالي مې ټول شنه شوي دي!"},
  {"type": "twopart", "setup": "پېرېدونکی: دا خوراکي توکي تازه دي؟", "delivery": "پلورونکی: هو، ځکه چې تر پرون ماښامه پورې ما هم نه و خوړلي!"},
  {"type": "twopart", "setup": "لومړی ملګری: ته ولې زما پیغامونه نه ځوابوې؟", "delivery": "دویم ملګری: ۳۰۰ پیغامونه مې ولیدل، خو لا تر اوسه په دې فکر کې یم چې کوم یو ته لومړی ځواب ورکړم!"},
  {"type": "single", "joke": "یو ماشوم خپلې مور ته وویل: زه غواړم لوی شم. مور: ولې زویه؟ ماشوم: ځکه چې بیا د خوړو لپاره پیسې نه غواړم، خپله به یې ګټم!"},
  {"type": "twopart", "setup": "پوښتنه: کمره ولې ګرمه شوه؟", "delivery": "ځواب: ځکه چې زموږ عکاس د 'کولر' په کارولو نه پوهېږي!"},
  {"type": "single", "joke": "پولیس: ولې ترافیک دومره زیات دی؟ چلوونکی: ځکه چې ټول غواړي خپل موټرونه په یو ځای کې ودروي!"},
  {"type": "single", "joke": "یو څوک: زما کمپیوټر ډېر هوښیار دی. ملګری: څنګه؟ کله چې رمز وغواړي، زه ورته وایم 'وروسته'!"},
  {"type": "twopart", "setup": "مېلمه له کوربه وپوښتل: ستاسو په کور کې ساعت ولې شاته پاتې دی؟", "delivery": "کوربه: ځکه چې موږ غواړو له وخت څخه ډېره ګټه واخلو!"},
  {"type": "single", "joke": "دوکاندار: دا کالي ۵۰٪ تخفیف لري. پېرېدونکی: نو قیمت یې نیم دی؟ دوکاندار: نه، یوازې اندازه یې نیمه ده!"},
  {"type": "twopart", "setup": "یو ملګري له بل وپوښتل: ولې دومره خپه ښکارې؟", "delivery": "ملګری: ځکه چې ما خپل ټول خوږ په کور کې پرېښی دی!"},
  {"type": "single", "joke": "یو کس: زه له ژوند څخه خوند اخلم. ملګری: څنګه؟ هغه: کله چې خلک زما ټوپک ته ګوري، زه تمرین نه کوم!"},
  {"type": "twopart", "setup": "پلار له زوی څخه: ستا د ازموینې پایلې ولې تل خرابې وي؟", "delivery": "زوی: ځکه چې ښې پایلې د شپې خوب نه ویني!"},
  {"type": "single", "joke": "یو سړی: زه د هېرولو ناروغي لرم. ما هېره کړې چې له چا سره خبرې کوم!"},
  {"type": "single", "joke": "کوربه: موږ به سبا غرمه چای وڅښو. مېلمه: ډېر ښه، خو د چای وخت راته ووایه، چې زه خپل پروګرام جوړ کړم!"},
  {"type": "twopart", "setup": "ډاکټر: تاسو باید ورزش وکړئ. ناروغ: څومره؟", "delivery": "ډاکټر: لږ تر لږه دومره چې د تلویزیون چینل په ریموټ بدل کړئ!"},
  {"type": "single", "joke": "سړی: ما له ځان سره ژمنه وکړه چې لږ به خوراک کوم. بل سړی: نو څه وشول؟ سړی: ما خپله ژمنه وخوړه!"},
  {"type": "twopart", "setup": "پوښتنه: چرګ ولې له سړک څخه تېر شو؟", "delivery": "ځواب: ځکه چې بلې خوا ته یې کار و!"},
  {"type": "single", "joke": "یو څوک: ما خپل بانک ته زنګ وواهه. بانک: ستاسو پیسې خوندي دي. سړی: نو ولې زما کارت بند دی؟"},
  {"type": "twopart", "setup": "استاد: ولې دې کتاب لوستل پای ته ونه رسول؟", "delivery": "شاګرد: ځکه چې پاڼې هم ارام ته اړتیا لري!"},
  {"type": "single", "joke": "یو فیشنر: ما نوې جامې واخیستې. ملګری: څه نوي؟ هغه: د رنګ انتخاب یې یوه میاشت وخت ونیو!"},
  {"type": "single", "joke": "په پخوا زمانه کې خلکو لیکونه استول، اوس خلک یو بل ته 'میمونه' استوي."},
  {"type": "twopart", "setup": "ملا نصرالدین ته یو چا وویل: ستا خره ورکه ده!", "delivery": "ملا وخندل. هغه کس ورته وویل: خره دې ورکه ده او ته خاندې؟ ملا وویل: شکر چې زه پرې سپوږم نه وم، کنه زه به هم ورک وای!"},
  {"type": "single", "joke": "که غواړې چې خوشحاله اوسې، نو وائی فائی ته نږدې کېنه."},
  {"type": "twopart", "setup": "یو سړی له ډاکټره وپوښتل: څنګه کولی شم اوږد ژوند وکړم؟", "delivery": "ډاکټر: واده وکړه. سړی: نو بیا به اوږد ژوند وکړم؟ ډاکټر: نه، خو د اوږد ژوند فکر به دې له سره ووځي."},
  {"type": "single", "joke": "زما موبایل دومره زوړ دی چې کامره یې هم تور او سپین عکسونه اخلي."},
  {"type": "twopart", "setup": "یو هلک خپل پلار ته وویل: پلاره، غواړم تلویزیون وګورم.", "delivery": "پلار: سمه ده، خو چالان یې نه کړې!"},
  {"type": "single", "joke": "د نن زمانې مینه داسې ده لکه بلوتوث، که نږدې وې وصل وي، که لرې شوې نو نوی ډیوایس لټوي."},
  {"type": "twopart", "setup": "یو कंजوس خپل زوی ته وویل: که په امتحان کې کامیاب شوې، نو تاته به پنځه روپۍ درکړم.", "delivery": "زوی چې کله کور ته راغی، پلار ته یې وویل: پلاره، ستا پنځه روپۍ بچ شوې!"},
  {"type": "single", "joke": "ژوند د ریاضی سوال په څېر دی، کله چې یې حل کړې، نو پوه شې چې طریقه دې غلطه وه."},
  {"type": "twopart", "setup": "یو سړی په منډه کور ته راغی او خپلې ښځې ته یې وویل: چای تیار کړه، ملګري مې راځي!", "delivery": "ښځې ورته وویل: په کور کې بوره نشته. سړي وویل: ته چای تیار کړه، بوره به له ملګرو وغواړو!"},
  {"type": "single", "joke": "د ځینو خلکو مغز داسې دی لکه برمودا مثلث، هر څه چې ورشي ورک شي."},
  {"type": "twopart", "setup": "استاد: اوبه په کوم ځای کې کنګل کیږي؟", "delivery": "شاګرد: په نقشه کې!"},
  {"type": "single", "joke": "که غواړې چې وزن کم کړې، نو خپل خواړه له ملګرو سره شریک کړه."}
]
