[
  {
    "proverb": "اوبه په ډانګ نه بیلیږي.",
    "translation": "Water cannot be separated by a stick.",
    "meaning": "You cannot separate people who are closely bonded, like family or a tight-knit community."
  },
  {
    "proverb": "غره ته مه ګوره، ځان ته ګوره.",
    "translation": "Don't look at the mountain, look at yourself.",
    "meaning": "Focus on your own capabilities and limitations rather than the size of the challenge ahead."
  },
  {
    "proverb": "دوه هندواڼې په یو لاس کې نه ځاییږي.",
    "translation": "Two watermelons cannot be held in one hand.",
    "meaning": "You cannot effectively manage two major tasks or responsibilities at the same time. Focus on one thing at a time."
  },
  {
    "proverb": "مېلمه د خدای دوست وي.",
    "translation": "A guest is a friend of God.",
    "meaning": "Guests should be treated with the utmost respect and hospitality, as they are considered a blessing."
  },
  {
    "proverb": "که غر لوړ دی، پر سر یې لار شته.",
    "translation": "Even if the mountain is high, there is a path to its top.",
    "meaning": "Every problem, no matter how difficult it seems, has a solution. Perseverance will lead you to it."
  },
  {
    "proverb": "له یو لاس څخه ټک نه خیږي.",
    "translation": "A clap cannot be produced with one hand.",
    "meaning": "Cooperation and teamwork are necessary to achieve certain goals. Some things cannot be done alone."
  },
  {
    "proverb": "خپله خوله، خپله کلا ده.",
    "translation": "Your mouth is your castle.",
    "meaning": "Be mindful of your words. What you say can either protect you or get you into trouble."
  },
  {
    "proverb": "ړوند ته اینه مه ورکوه.",
    "translation": "Don't give a mirror to a blind person.",
    "meaning": "Don't offer something useless to someone who cannot appreciate or benefit from it."
  },
  {
    "proverb": "د صبر میوه خوږه وي.",
    "translation": "The fruit of patience is sweet.",
    "meaning": "Good things come to those who wait. Patience and perseverance eventually lead to a positive outcome."
  },
  {
    "proverb": "آسمان په لستوڼي نه پټیږي.",
    "translation": "The sky cannot be hidden with a sleeve.",
    "meaning": "You cannot hide the truth. Obvious facts will eventually reveal themselves, no matter how hard you try to conceal them."
  },
  {
    "proverb": "مار خوړلی د پړي نه بیریږي.",
    "translation": "He who has been bitten by a snake is afraid of a rope.",
    "meaning": "A person who has had a bad experience will be cautious of similar situations."
  },
  {
    "proverb": "د تورو شپو سبا هم شته.",
    "translation": "Even dark nights are followed by dawn.",
    "meaning": "Difficult times don't last forever; there is always hope for a better future."
  },
  {
    "proverb": "کمزوری په قهر ژاړي.",
    "translation": "The weak weep in anger.",
    "meaning": "Those who are powerless often express their frustration through tears rather than action."
  },
  {
    "proverb": "لیوه چې بوډا شي، د سپو مسخره شي.",
    "translation": "When a wolf gets old, it becomes the dogs' laughingstock.",
    "meaning": "When a powerful person loses their strength, even their inferiors will mock them."
  },
  {
    "proverb": "د بل په لاس مار مه وژنه.",
    "translation": "Don't kill a snake with another's hand.",
    "meaning": "Don't rely on others to solve your problems for you; take responsibility yourself."
  },
  {
    "proverb": "د غل مخ تور وي.",
    "translation": "The face of a thief is black.",
    "meaning": "Guilt is always visible on a person's face."
  },
  {
    "proverb": "د هر چا خپل وطن کشمیر دی.",
    "translation": "To everyone, their own homeland is Kashmir.",
    "meaning": "People naturally find their own home to be the most beautiful place in the world."
  },
  {
    "proverb": "زړه چې غواړي، پښې ځغلي.",
    "translation": "When the heart desires, the feet run.",
    "meaning": "If you are truly motivated to do something, you will find the energy and means to do it."
  },
  {
    "proverb": "د درواغو مزل لنډ وي.",
    "translation": "The journey of a lie is short.",
    "meaning": "Lies are eventually exposed; the truth always prevails."
  },
  {
    "proverb": "چې په ځان نه لرې، په بل یې مه لره.",
    "translation": "What you don't want for yourself, don't wish upon others.",
    "meaning": "The golden rule: treat others as you would like to be treated."
  },
  {
    "proverb": "د نېکۍ اوبه په بحر کې نه ورکیږي.",
    "translation": "A good deed is never lost, even in the ocean.",
    "meaning": "Kindness and good actions are never wasted, no matter how small they may seem."
  },
  {
    "proverb": "د یو ګل سره پسرلی نه کیږي.",
    "translation": "Spring doesn't come with a single flower.",
    "meaning": "One person alone cannot bring about significant change; it requires a collective effort."
  },
  {
    "proverb": "د بیړه کار د شیطان وي.",
    "translation": "Hasty work is the devil's work.",
    "meaning": "Rushing things leads to mistakes. It's better to be patient and do things properly."
  },
  {
    "proverb": "د لمر په څېر ښکاره خبره ده.",
    "translation": "It is as clear as the sun.",
    "meaning": "Used to describe something that is obvious and cannot be denied."
  },
  {
    "proverb": "د عقل کار په زور نه کیږي.",
    "translation": "Work that requires intelligence cannot be done with force.",
    "meaning": "Brute force is not a substitute for wisdom and careful planning."
  }
]
