[
  {
    "proverb": "اوبه په ډانګ نه بیلیږي.",
    "translation": "Water cannot be separated by a stick.",
    "meaning": "You cannot separate people who are closely bonded, like family or a tight-knit community."
  },
  {
    "proverb": "غره ته مه ګوره، ځان ته ګوره.",
    "translation": "Don't look at the mountain, look at yourself.",
    "meaning": "Focus on your own capabilities and limitations rather than the size of the challenge ahead."
  },
  {
    "proverb": "دوه هندواڼې په یو لاس کې نه ځاییږي.",
    "translation": "Two watermelons cannot be held in one hand.",
    "meaning": "You cannot effectively manage two major tasks or responsibilities at the same time. Focus on one thing at a time."
  },
  {
    "proverb": "مېلمه د خدای دوست وي.",
    "translation": "A guest is a friend of God.",
    "meaning": "Guests should be treated with the utmost respect and hospitality, as they are considered a blessing."
  },
  {
    "proverb": "که غر لوړ دی، پر سر یې لار شته.",
    "translation": "Even if the mountain is high, there is a path to its top.",
    "meaning": "Every problem, no matter how difficult it seems, has a solution. Perseverance will lead you to it."
  },
  {
    "proverb": "له یو لاس څخه ټک نه خیږي.",
    "translation": "A clap cannot be produced with one hand.",
    "meaning": "Cooperation and teamwork are necessary to achieve certain goals. Some things cannot be done alone."
  },
  {
    "proverb": "خپله خوله، خپله کلا ده.",
    "translation": "Your mouth is your castle.",
    "meaning": "Be mindful of your words. What you say can either protect you or get you into trouble."
  },
  {
    "proverb": "ړوند ته اینه مه ورکوه.",
    "translation": "Don't give a mirror to a blind person.",
    "meaning": "Don't offer something useless to someone who cannot appreciate or benefit from it."
  },
  {
    "proverb": "د صبر میوه خوږه وي.",
    "translation": "The fruit of patience is sweet.",
    "meaning": "Good things come to those who wait. Patience and perseverance eventually lead to a positive outcome."
  },
  {
    "proverb": "آسمان په لستوڼي نه پټیږي.",
    "translation": "The sky cannot be hidden with a sleeve.",
    "meaning": "You cannot hide the truth. Obvious facts will eventually reveal themselves, no matter how hard you try to conceal them."
  }
]
